20240113064245-designing_static_methods_and_variables.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-01 Sun 15:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Designing Static Methods and Variables</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Designing Static Methods and Variables</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgea59da8">1. Designing Static Methods and Variables</a>
<ul>
<li><a href="#org5317fca">1.1. Example</a></li>
<li><a href="#org6192db3">1.2. Static Variables</a></li>
<li><a href="#org93ad003">1.3. Static Methods</a></li>
<li><a href="#org72d3f81">1.4. Class VS Instance Membership</a></li>
<li><a href="#org0126993">1.5. Static Variable Modifiers</a></li>
<li><a href="#orgccf4d3d">1.6. Static Initializers</a></li>
<li><a href="#org1a52336">1.7. Static Imports</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgea59da8" class="outline-2">
<h2 id="orgea59da8"><span class="section-number-2">1.</span> Designing Static Methods and Variables</h2>
<div class="outline-text-2" id="text-1">
<p>
<code>Methods</code> and <code>variables</code> declared <code>static</code> don’t require an <i>instance</i> of the <code>class</code>.
</p>
</div>

<div id="outline-container-org5317fca" class="outline-3">
<h3 id="org5317fca"><span class="section-number-3">1.1.</span> Example</h3>
<div class="outline-text-3" id="text-1-1">
<p>
A common use for <code>static</code> variables is counting the number of <code>instances</code>:
</p>

<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">Counter</span> {
    <span class="org-keyword">private</span> <span class="org-keyword">static</span> <span class="org-type">int</span> <span class="org-variable-name">count</span>;
    <span class="org-keyword">public</span> Counter() { count++; }
    <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">main</span>(<span class="org-type">String</span>[] <span class="org-variable-name">args</span>) {
        <span class="org-type">Counter</span> <span class="org-variable-name">c1</span> = <span class="org-keyword">new</span> <span class="org-type">Counter</span>();
        <span class="org-type">Counter</span> <span class="org-variable-name">c2</span> = <span class="org-keyword">new</span> <span class="org-type">Counter</span>();
        <span class="org-type">Counter</span> <span class="org-variable-name">c3</span> = <span class="org-keyword">new</span> <span class="org-type">Counter</span>();
        System.out.println(count); <span class="org-comment-delimiter">// </span><span class="org-comment">3
</span>    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org6192db3" class="outline-3">
<h3 id="org6192db3"><span class="section-number-3">1.2.</span> <a href="20240113065406-static_variable.html#ID-90b4776a-f230-4e13-b1a1-248b48026677">Static Variables</a></h3>
</div>
<div id="outline-container-org93ad003" class="outline-3">
<h3 id="org93ad003"><span class="section-number-3">1.3.</span> <a href="20240113065453-static_methods.html#ID-71f8ac46-9cca-4866-b701-8f5a7f9f7fc0">Static Methods</a></h3>
</div>
<div id="outline-container-org72d3f81" class="outline-3">
<h3 id="org72d3f81"><span class="section-number-3">1.4.</span> <a href="20240113070607-class_vs_instance_membership.html#ID-856bbd74-4651-4dc8-92d9-c9a2d280b85f">Class VS Instance Membership</a></h3>
</div>
<div id="outline-container-org0126993" class="outline-3">
<h3 id="org0126993"><span class="section-number-3">1.5.</span> <a href="20240114061956-static_variable_modifiers.html#ID-9a77d925-1adb-46ac-9e18-f117a8686ca2">Static Variable Modifiers</a></h3>
</div>
<div id="outline-container-orgccf4d3d" class="outline-3">
<h3 id="orgccf4d3d"><span class="section-number-3">1.6.</span> <a href="20240114063138-static_initializers.html#ID-9b5e5215-73c3-412e-8a72-57dc575c1ee9">Static Initializers</a></h3>
</div>
<div id="outline-container-org1a52336" class="outline-3">
<h3 id="org1a52336"><span class="section-number-3">1.7.</span> <a href="20240114063840-static_imports.html#ID-17f335ce-26e0-4376-afc3-2092875622f6">Static Imports</a></h3>
</div>
</div>
</div>
</body>
</html>
